pmorgantech/WaveX/firmware/esp32/sdkconfig.defaults
# ESP32-S3 WaveX Configuration Defaults

# Set target chip
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Serial port configuration
CONFIG_ESPTOOLPY_PORT="/dev/ttyACM0"
CONFIG_ESPTOOLPY_BAUD_921600B=y
CONFIG_ESPTOOLPY_BAUD=921600

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
# CONFIG_FREERTOS_UNICORE is not set

# SPI configuration  
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# CRITICAL: Memory Layout Optimization to prevent fragmentation
# Reduce all task stack sizes to minimize early heap fragmentation
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768        # Increased from 16KB to 32KB for LVGL init
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800

# Optimize stack sizes to reduce memory fragmentation
CONFIG_FREERTOS_IDLE_TASK_STACK_SIZE=1024   # Reduced from 1536

# Drastically reduce system task stack sizes
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=1536  # Reduced from 4096
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=1536        # Reduced from 4096  
CONFIG_ESP_TIMER_TASK_STACK_SIZE=1536         # Reduced from 3584
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024           # Reduced from 1280

# LVGL Memory Pool Configuration - Use PSRAM for widgets, internal for display
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_SIZE_KILOBYTES=512          # Larger LVGL heap in PSRAM
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=128  # Larger expansion in PSRAM
CONFIG_LV_MEM_ADR=0x0

# Force LVGL allocations to PSRAM where possible
CONFIG_LV_MEM_BUF_MAX_NUM=16

# Alternative: Use custom memory management for LVGL
CONFIG_LV_MEM_CUSTOM=n

# PSRAM Configuration - Use for large assets, NOT display buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768   # Keep critical allocations < 32KB in internal RAM
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=64768 # Reserve more internal RAM for system use
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_CACHE_WORKAROUND=y

# Watchdog configuration - Extended timeout for development
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Power Management - Disable to avoid USB issues and screen going black
CONFIG_PM_ENABLE=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB Configuration for stability
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=256
CONFIG_TINYUSB_CDC_TX_BUFSIZE=256

# LVGL configuration - Optimized memory and stack usage
CONFIG_LVGL_TASK_STACK_SIZE=8192
CONFIG_LVGL_TASK_PRIORITY=5

# FT6X36 Touch Controller Configuration - Match hardware pins
CONFIG_TOUCH_SDA=20
CONFIG_TOUCH_SCL=9
CONFIG_TOUCH_INT=-1
CONFIG_I2C_MASTER_FREQUENCY=100000
CONFIG_L58_MULTITOUCH=0
CONFIG_FT6X36_DEBUG=0
CONFIG_FT6X36_DEBUG_EVENTS=0

# Disable wireless features to save memory
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n

# Disable TLS/SSL features to save memory
CONFIG_MBEDTLS_TLS_DISABLED=y

# Memory optimization - Reduce various buffer sizes
CONFIG_ESP_TIMER_TASK_STACK_SIZE=1536
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024

# Reduce FreeRTOS timer task stack
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=1024

# Disable GDB stub to save memory
CONFIG_ESP_GDBSTUB_ENABLED=n

# Disable core dump to save memory  
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y

# Disable performance monitoring to save memory
CONFIG_ESP_TIMER_PROFILING=n

# Disable ultra-low power features to save memory
CONFIG_ULP_COPROC_ENABLED=n

# Optimize wear levelling
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096

# Optimize VFS to save memory
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_MAX_COUNT=4

# Reduce log buffer size to save memory
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3

# You can also specifically disable SPI debug logging
CONFIG_LOG_DEFAULT_LEVEL=3

# Reduce LWIP memory usage
CONFIG_LWIP_MAX_SOCKETS=4
CONFIG_LWIP_TCP_RECVMBOX_SIZE=4
CONFIG_LWIP_UDP_RECVMBOX_SIZE=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# Additional memory optimizations
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y

# Optimize compiler for size where memory is critical
CONFIG_COMPILER_OPTIMIZATION_SIZE=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Ensure minimal memory footprint for components
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL=2

# Optimize partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Note: mDNS and SNTP configurations are not available in ESP-IDF 5.2
# These components are not built by default and don't have config options
# in the main sdkconfig. They would need to be added as components if needed. 

# Force single core mode for debugging
CONFIG_FREERTOS_UNICORE=y

# Ensure proper CPU frequency
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160 is not set 
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Disable potentially problematic features
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=n

# Ensure bootloader doesn't hang
CONFIG_BOOTLOADER_WDT_TIME_MS=9000

# Disable USB-related features that might cause issues
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_UART_DEFAULT=y 